Catalogs/Спецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Спецификации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВключаетНДС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СпецификацииПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СпецификацииПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураСырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Спецификации/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")Тогда
		
		пВладелец = Неопределено;
		ДанныеЗаполнения.Свойство("Владелец", пВладелец);
		ЕдиницаИзмерения = пВладелец.ЕдиницаХраненияОстатков;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	СпецификацияИзменена = Ложь;
	
	Если Не ЭтоНовый() Тогда
		
		// Изменились реквизиты шапки
		Если Владелец <> Ссылка.Владелец ИЛИ ЕдиницаИзмерения <> Ссылка.ЕдиницаИзмерения Тогда
			СпецификацияИзменена = Истина;
		КонецЕсли;
		
		// Изменился состав
		ТЗ = Состав.Выгрузить(,"Номенклатура, ЕдиницаИзмерения, Количество");
		
		Для Каждого Строка Из Ссылка.Состав Цикл
			НовСтр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Строка);
			НовСтр.Количество = -Строка.Количество;
		КонецЦикла;	
		
		ТЗ.Свернуть("Номенклатура, ЕдиницаИзмерения", "Количество");
		СпецификацияИзменена = ТЗ.Итог("Количество")<>0;
		
	КонецЕсли;
	
	Если СпецификацияИзменена Тогда
		ПроверитьЗаписиВРегистреСведенийСпецификацииПоставщиковВЗакрытомПериоде(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаписиВРегистреСведенийСпецификацииПоставщиковВЗакрытомПериоде(Отказ)
	
	СоответствиеГраницЗапрета = ПолныеПрава.ПолучитьГраницыЗапретаИзмененияДанных().Получить();
	
	Если СоответствиеГраницЗапрета <> Неопределено Тогда
		
		ДатаЗапрета = СоответствиеГраницЗапрета.Получить(Справочники.Организации.ПустаяСсылка());
		
		Если ДатаЗапрета <> Неопределено Тогда
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	СпецификацииПоставщиков.Спецификация
			|ИЗ
			|	РегистрСведений.СпецификацииПоставщиков КАК СпецификацииПоставщиков
			|ГДЕ
			|	СпецификацииПоставщиков.Период <= &ДатаЗапрета
			|	И СпецификацииПоставщиков.Спецификация = &Спецификация");
			Запрос.УстановитьПараметр("ДатаЗапрета", ДатаЗапрета);
			Запрос.УстановитьПараметр("Спецификация", Ссылка);
			
			Если Не Запрос.Выполнить().Пустой()Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя изменять спецификацию, есть записи в закрытом периде! Запись не выполнена!",,,,Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
